# Введення значень a з перевіркою
a = int(input("Введіть значення a (від 1 до 100): "))
while not (1 <= a <= 100):
    print("Помилка: Значення a повинно бути в діапазоні від 1 до 100.")
    a = int(input("Введіть значення a (від 1 до 100): "))

# Введення значень b з перевіркою
b = int(input("Введіть значення b (від 1 до 100): "))
while not (1 <= b <= 100):
    print("Помилка: Значення b повинно бути в діапазоні від 1 до 100.")
    b = int(input("Введіть значення b (від 1 до 100): "))


# Обчислення значення X
if a < b:
    X = (b / a) - 1
elif a == b:
    X = -295
else:  # a > b
    X = (a - 235) / b

# Виведення результату
print("Значення X: ", X)
